# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe'
brew 'svn'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'composer'
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'php@7.2'
#  pecl install xdebug -- does not belong in this file
brew 'gh'

brew 'composer'
brew 'imagemagick'
brew 'libmemcached'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'vim'
# brew 'ksdiff'

brew 'nmap'

#code
brew 'prettier'
tap 'caskroom/fonts'

# Apps
cask '1password'
# cask '1password-cli' -> no arm
cask 'aerial'
cask 'alfred'
# cask 'adobe-creative-cloud'
cask 'bartender'
cask 'balenaetcher'
cask 'caffeine'
cask 'carbon-copy-cloner'
cask 'cleanmymac'
cask 'clover-configurator'
cask 'cyberghost-vpn'
cask 'dbngin'
cask 'discord'
cask 'docker'
brew 'docker-machine-parallels'
cask 'firefox'
cask 'gitkraken'
cask 'google-drive'
cask 'google-chrome'
#cask 'flux'
cask 'hazel'
cask 'imageoptim'
#cask 'iterm2'
cask 'jetbrains-toolbox'
#cask 'microsoft-teams' -- needs rosetta first : sudo softwareupdate --install-rosetta
cask 'openaudible'
#cask 'phpstorm'
cask 'parallels'
cask 'parallels-toolbox'
cask 'paw'
cask 'prusaslicer'
cask 'screenflow'
# cask 'skype'
cask 'slack'
cask 'steam'
cask 'sublime-text'
cask 'tableplus'
# cask 'kaleidoscope'
cask 'the-unarchiver'
cask 'tinkerwell'
# cask 'transmission'
cask 'transmit'
cask 'visual-studio-code'
cask 'vlc'

cask 'signal'
cask 'ultimaker-cura'
cask 'anydesk'
cask 'forklift'
cask 'tweetbot'
# cask 'duet'

# Quicklook
# cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'Numbers', id: 409203825
# mas 'Spark', id: 1176895641
# mas 'Speedtest', id: 1153157709
# mas 'Things', id: 904280696


# mas 'Tot', id: 1491071483
# mas 'Jump Desktop', id: 524141863
# mas 'Moom', id: 419330170
# mas 'CodeRunner', id: 955297617
# mas 'MindNode', id: 1289197285
# mas 'Xcode', id: 497799835
# mas 'PDFScanner', id: 410968114
# mas 'Fantastical', id: 975937182
# mas 'SnippetsLab', id: 1006087419

# mas 'Gemini 2', id: 1090488118
# mas 'Toggl Track', id: 957734279
# mas 'SnippetsLab', id: 100608741

# mas 'Affinity Designer', id: 824171161
# mas 'Ulysses', id: 1225570693
# mas 'Audiobook Builder', id: 1437681957
# mas 'Microsoft Word', id: 462054704

# mas 'Day One', id: 1055511498
# mas 'Bear', id: 1091189122
